app/views/users/show.html.erb

			<h3>Member since <%= @user.created_at.strftime("%B %d, %Y") %></h3>
			<h4><%= @user.comments.count %> comments posted</h4>
			<h4><%= @user.comments.where(rating: '5_stars').count %> five-star ratings</h4>
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."user_id" = $1 AND "comments"."rating" = $2  [["user_id", 1], ["rating", "5_stars"]]

	<div class="row">
		<% @user.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = $1  [["user_id", 1]]

	<br />
	<% @user.places.each do |place| %>
---
SELECT "places".* FROM "places" WHERE "places"."user_id" = $1  [["user_id", 1]]

				<p><%= place.description %></p>
				<% if place.user.present? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

			<div class="col-12 col-md-3">
				<% if place.photos.present? %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."place_id" = $1  [["place_id", 1]]


		<% if place.comments.present? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."place_id" = $1  [["place_id", 1]]