app/controllers/places_controller.rb

SELECT  "places".* FROM "places" ORDER BY "places"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "places"
---
	def index
		@places = Place.order(:id).paginate(:page => params[:page], :per_page => 10)

INSERT INTO "places" ("name", "description", "address", "created_at", "updated_at", "user_id", "latitude", "longitude") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
	def create
		@place = current_user.places.create(place_params)

SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def show
			@place = Place.find(params[:id])

SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
	def edit
		@place = Place.find(params[:id])

SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "places" SET "description" = $1, "updated_at" = $2 WHERE "places"."id" = $3  [["description", "A fun place to go"], ["updated_at", "2019-09-15 20:08:30.102981"], ["id", 2]]
---
	def update
		@place = Place.find(params[:id])
		if @place.user != current_user
			return render plain: 'Not Allowed', status: :forbidden
		end

		@place.update_attributes(place_params)