app/views/places/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

				<% if place.user.present? %>

SELECT "photos".* FROM "photos" WHERE "photos"."place_id" = $1  [["place_id", 1]]
---
			<div class="col-12 col-md-3">
				<% if place.photos.present? %>

SELECT "comments".* FROM "comments" WHERE "comments"."place_id" = $1  [["place_id", 1]]
---

		<% if place.comments.present? %>