app/views/places/show.html.erb

	<div class="row col-10 offset-1">
		<% @place.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."place_id" = $1  [["place_id", 1]]

	<div class="row col-10 offset-1">
		<% @place.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."place_id" = $1  [["place_id", 1]]